; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image2 - mode
	thermograph1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation5 - direction
	Star9 - direction
	Star1 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation3 - direction
	Star10 - direction
	GroundStation12 - direction
	Star7 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star10)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
	(supports instrument3 thermograph1)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 thermograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star6)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation12)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation11)
)
(:goal (and
	(pointing satellite1 Star14)
	(pointing satellite2 Phenomenon17)
	(have_image Planet13 thermograph0)
	(have_image Star14 image2)
	(have_image Phenomenon15 image2)
	(have_image Planet16 image2)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 8
5. (take_image satellite1 planet13 instrument3 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon17 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon17 instrument3 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon15 instrument3 image2)
   added: (have_image phenomenon15 image2)
   goals met: 3 of 8
10. (turn_to satellite1 planet16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet16)
   goals met: 3 of 8
11. (take_image satellite1 planet16 instrument3 image2)
   added: (have_image planet16 image2)
   goals met: 4 of 8
12. (turn_to satellite1 planet18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet18)
   goals met: 4 of 8
13. (take_image satellite1 planet18 instrument3 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 5 of 8
14. (turn_to satellite1 star14 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star14)
   goals met: 6 of 8
15. (take_image satellite1 star14 instrument3 image2)
   added: (have_image star14 image2)
   goals met: 7 of 8
16. (turn_to satellite2 phenomenon17 groundstation11)
   deleted: (pointing satellite2 groundstation11)
   added: (pointing satellite2 phenomenon17)
   goals met: 8 of 8
